<script>
	import { counter } from "../stores/counter.js"

	const content = {
		title: "पवित्रशास्त्र",
		sections: [
			`१. पवित्रशास्त्र ही सम्पूर्ण उद्धार करनेवाले ज्ञान, विश्वास, और आज्ञाकारिता का एक मात्र पर्याप्त, निश्चित, और रुटिहीन मापदण्ड है। (लोग कैसे उद्धार पाते हैं, उद्धार करनेवाले विश्वास का स्वभाव, और उद्धार पाने के बाद उन्हें कैसा जीवन जीना चाहिये। "पर्याप्त" शब्द से तात्पर्य यह है कि पवित्र शास्त्र में वे सब बातें निहित हैं जिन्हें 
हमें जानने की आवश्यकता है। यह हर सम्भव विषयों पर विचार करता है, और इस कारण परमेश्वर किसी अन्य स्रोत को उसका पूरक होने के लिये प्रेरणा नहीं देता है।)`,
			`यद्यपि प्रकृति का प्रकाश (स्वाभाविक बुद्धि) और सृष्टि और पूर्वप्रबन्ध का कार्य परमेश्वर की भलाई, बुद्धि, और सामर्थ्य को इतना दर्शाते हैं, कि मनुष्य (अपने अविश्वास के लिये) निरुत्तर है, तथापि वे परमेश्वर और उसकी इच्छा के उस ज्ञान को उपलब्ध कराने के लिये अपर्याप्त हैं जो उद्धार के लिये आवश्यक है।`,
			`अतएव प्रभु को यह अच्छा लगा कि थोड़ा थोड़ा करके (विभिन्न समयों में) और भाँति भाँति से (विभिन्न तरीकों से) अपने आप को, और अपनी इच्छा को अपनी कलीसिया (अपने लोगों) पर`,
			`और तत्पश्चात, सत्य के बेहत्तर सुरक्षा और प्रसार के लिये, और कलीसिया के और अधिक निश्चित स्थापना और शांति के लिये, उसे शरीर के सड़ाहट, (मनुष्य के विचार शीघ्र ही कलीसिया को बिगाड़ देगा) और शैतान और संसार के द्वेष से बचाने के लिये प्रगट करे,`,
			`प्रभु को यह अच्छा लगा कि अपने प्रगटित सत्य को सम्पूर्ण रीति से लिपिबद्ध करे। अतएव पवित्रशास्त्र अब अत्यावश्यक (नितांत अनिवार्य) हैं, पहले के तरीके जिन के द्वारा परमेश्वर ने अपनी इच्छा अपने लोगों पर प्रगट की अब समाप्त हो गये।`,
		],
	}
	let sectionIndex = 0
	const nextSection = () => (sectionIndex += 1)
</script>

<div id="content">
	<h2 id="chapter_name" class="center">{content.title}</h2>
	<div id="slider" class="justify">
		{content.sections[$counter]}
	</div>
</div>

<style>
	#content {
		text-align: center;
		max-width: 800px;
		margin: auto;
		display: flex;
		flex-direction: column;
		justify-content: center;
	}
	#chapter_name {
		font-size: 3rem;
	}
	.justify {
		text-align: justify;
	}
	.center {
		text-align: center;
	}
	#slider {
		font-size: 1.5rem;
	}

	@media (max-width: 900px) {
		#content {
			padding: 0.4rem;
		}
		#slider {
			font-size: 1.3rem;
		}
	}
</style>
